{
      "code":"HOS.1",
      "descriptor":"Manage my work and set goals.",
      "statement":"I can demonstrate effective personal work habits to help me achieve my academic and personal goals.",
      "skill":[
        {
          "code":"HOS.1.1",
          "descriptor":"Manage tasks and deadlines",
          "statement":"How well do I manage my tasks and deadlines?",
          "level":[{
            "2":"My teacher keeps track of my tasks and due dates. More than 25% of my work is late or incomplete.",
            "4":"My teacher helps me keep track of my tasks and due dates. Less than 25% of my tasks are overdue or incomplete. I let my teacher know when I need help.",
            "6":"With support from my teacher, I can keep track of my tasks and my due dates. Less than 10% of my tasks that are overdue or incomplete. I let my teacher know when I need help or when I need more time to turn in work before the deadline.",
            "8":"I can keep track of my tasks and due dates on my own. Almost none of my tasks are overdue or incomplete.I can finish an important task 24 hours before it is due. I integrate constructive feedback from my peers or teachers into some of my most important work before I turn it in.",
            "10":"I use a task management system to keep track of my tasks and due dates. I consistently submit my work on time. I finish some of my most important tasks 24 hours before they are due.I integrate constructive feedback from my peers or teachers into most of my most important work before I turn it in.",
            "12":"I consistently use a task management system to keep track of my tasks and due dates. I can prioritize my work so that I meet all of my due dates. I finish all of my most important tasks 24 hours before they are due.I integrate constructive feedback from my peers or teachers into all of my most important work before I turn it in."
          }]
        },
        {
          "code":"HOS.1.2",
          "descriptor":"Set Goals",
          "statement":"How well do I set, achieve, and reflect on my goals?",
          "level":[{
            "2":"I can work with my teacher to set a goal for myself. I can think of one or two ways to make sure I achieve my goal/s. I can reflect on what I did to achieve my goal/s.",
            "4":"With support from my teacher/advisor, I can set a measurable goal (e.g. SMART goal) for my personal or academic growth. I can make a plan for how I will achieve my goal. I can submit reflections about my progress towards achieving my goal. If I am not making progress, I can work with my teacher/advisor to revise my goal and plan.",
            "6":"I can independently set a measurable goal (e.g. SMART goal) for my personal and academic growth. I can create an action plan for each goal. I can submit weekly reflections about my progress towards achieving my goals. If I am not making progress, I can work with my teacher/advisor to revise my goals and action plan.",
            "8":"I can set measurable goals (e.g. SMART goal) for my personal and academic growth. I can also set a goal in another area (e.g., career, college, sports). I can create an action plan for each goal. This action plan is challenging but not impossible to do. I can submit weekly reflections that include evidence of my progress towards achieving my goals. If I am not making progress, I work with my teacher/advisor to revise my goals and action plan. ",
            "10":"I can set measurable goals (e.g. SMART goals) to help me grow personally, academically, and in other areas of focus (e.g., career, college, sports). I can revise my goals as I meet them and continue to challenge myself. I can create an action plan in my for each goal. This action plan is challenging but not impossible to do. I can submit weekly reflections that include evidence of my progress towards achieving my goals. If I am not making progress, I seek support from members in my personal and professional network who can help me achieve my goals. I can identify possible barriers to achieving each goal and ways to overcome them.",
            "12":"I can set measurable goals (e.g. SMART goals) to help me grow personally, academically, and in other areas of focus (e.g., career, college, sports). I can revise my goals as I meet them and continue to challenge myself. I get feedback on my goals to ensure they are measurable and achievable. I can create an action plan for each goal on my own. This action plan is challenging but not impossible to do. I can get feedback on my action plan from members of my personal and professional network to improve my ability to achieve my goals. I can submit weekly reflections that include evidence of my progress towards achieving my goals. If I am not making progress, I seek support from members in my personal and professional network who can help me achieve my goals. I can identify possible barriers to achieving each goal and ways to overcome them."
          }]
        },
        {
          "code":"HOS.1.3",
          "descriptor":"Be organized and prepared",
          "statement":"How well do I keep myself organized and come prepared to learn?",
          "level":[{
            "2":"I am still working on getting the materials I need and/or completing the work that I need for my studio. If someone tells me how, then I can locate my digital files.",
            "4":"I am still working on getting the materials I need or completing the work that I need for my studio. With help from others, I can keep my things organized, safe, and in good condition. Sometimes I need help taking care of things for which I am responsible. With some help, I can locate my digital files.",
            "6":"I sometimes have the materials I need, and I sometimes have completed the work that I need for my studio. I am mostly organized and and can keep my things in good condition. Sometimes I need help taking care of things for which I am responsible. I have ways to find my digital files but I need to create an organizational system to help me better manage them.",
            "8":"I almost always have all of my materials and work completed that I need for my studio and am ready to learn. I am mostly organized and and can keep my things in good condition. I take good care of things for which I am responsible. I have created an organizational system for my digital files and am working to consistently use it.",
            "10":"I always have all of my materials and have completed all of the work I need for my studio so that I am ready to learn. I have my own process or strategy for keeping my things organized, safe, and in good condition. I take good care of things for which I am responsible. I am able to keep my digital files and folders organized.",
            "12":"I always come to my studio fully prepared and ready to learn. I use multiple strategies and/or systems for keeping my things organized, safe, and in good condition. I take special care of things for which I am responsible because I understand and appreciate how valuable they are to my learning. I consistently implement effective strategies for organizing and maintaining digital files and folder systems."
          }]
        },
        {
          "code":"HOS.1.4",
          "descriptor":"Stay focused and on task",
          "statement":"How well do I stay focused and on task?",
          "level":[{
            "2":"I am learning strategies for focusing on my learning task. I am learning strategies to remain on task.",
            "4":"With reminders, I can stay focused on my learning or my task. With reminders, I can remain on task with minimal distraction to others.",
            "6":"Sometimes I can think of a strategy to stay focused on my learning task. Sometimes I can remain on task without reminders.",
            "8":"I am most always focused and on task. I am adapting to different learning environment and conditions. ",
            "10":"I can stay focused on a task without needing guidance or supervision. I can adapt to different learning environments and have multiple strategies to keep my focus.",
            "12":"I can independently stay focused on my learning and my tasks for sustained periods of time. I can use multiple strategies to avoid distractions and to maintain focus and stay productive in any and all learning environments."
          }]
        },
        {
          "code":"HOS.1.5",
          "descriptor":"Improve my work.",
          "statement":"How well do I revise and improve my work?",
          "level":[{
            "2":"I can review my work and think about something I can do to make it better.",
            "4":"I can review my work and think about something I can do to make it better. With support, I can use the continua to make improvements to my work. When directed, I can revise my work.",
            "6":"I can use the continua to make improvements to my work. I can make improvements in the specific areas where I am directed to make changes.",
            "8":"I can use the continua to revise my work in each of the relevant skill areas. I can revise my work at least once before my final submission. I can use the feedback from my teacher to improve my work.",
            "10":"I can use the continua to identify specific ways that I can improve my work and get to the next level in each skill area. I understand that I am always able to take initiative to revise my work and continually improve it. I seek and use feedback from my teachers and peers to improve my work.",
            "12":"I can consistently reflect on and revise on my work, using the continua to make specific improvements in each skill area to achieve a higher level. I seek and use feedback from my teachers and peers in order to improve my work and my work process. I always try to make my work the best that it can be and I am consistently reaching higher levels on the continua and/or showing significant growth in my work."
          }]
        }
      ]
    }